AUTO_config_TK_pesok/src/Documents/ИзменениеПараметровСистемыЗаказов/ИзменениеПараметровСистемыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеПараметровСистемыЗаказов</name>
  <comment>Установка параметров системы заказов покупателей</comment>
  <registerRecords>InformationRegister.ПараметрыСистемыЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <comment>Юридическое лицо, от которого выписан документ</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <comment>Договор по которому ведутся взаиморасчеты с контрагентом</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыДокумента</name>
    <attributes>
      <name>ТочкаДоставки</name>
      <type>
        <types>CatalogRef.ТочкиДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьЗаказа</name>
      <type>
        <types>EnumRef.ВидыПериодичностиЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДниНедели</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокПоставки</name>
      <comment>Срок поставки (дней)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокПоставкиПоДнямНедели</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>28</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОкругления</name>
      <type>
        <types>EnumRef.ВариантыОкругленияКоличества</types>
      </type>
    </attributes>
    <attributes>
      <name>КвантПоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МодельРасчета</name>
      <comment>Модель расчета количества</comment>
      <type>
        <types>EnumRef.ВидыКоличестваЗаказа</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальныйОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокВитрина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РегламентЗаказа</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/Documents/ИзменениеПараметровСистемыЗаказов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
	#Область Проведение
	
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
		
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		
		Запрос = Новый Запрос;
		ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДополнительныеСвойства);
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		
		ТекстыЗапроса = Новый СписокЗначений;
		ТекстЗапросаПараметрыСисетмыЗаказов(Запрос, ТекстыЗапроса, Регистры);
		
		ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
		
		//Заполним порядок для регистра "Параметры системы заказов"
		ТаблицаПараметрыСисетмыЗаказов = Неопределено;
		Если ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаПараметрыСисетмыЗаказов", ТаблицаПараметрыСисетмыЗаказов) И ТипЗнч(ТаблицаПараметрыСисетмыЗаказов) = Тип("ТаблицаЗначений") Тогда 		
			ДатаДокумента = Формат(ДополнительныеСвойства.ДляПроведения.Дата, "ДФ=ггггММддЧЧммсс");
			НомерДокумента = СокрЛП(ДополнительныеСвойства.ДляПроведения.Номер);
			
			Для Каждого Стр Из ТаблицаПараметрыСисетмыЗаказов Цикл 
				НачалоДействия = Формат(Стр.НачалоДействия, "ДФ=ггггММдд");
				ВремяОкончания = Формат(Окр((Дата("20500101") - Стр.КонецДействия)/86400, 0), "ЧГ=0");
				Пока СтрДлина(ВремяОкончания) < 5 Цикл 
					ВремяОкончания = "0" + ВремяОкончания;
				КонецЦикла;
				
				Стр.Порядок = НачалоДействия + ВремяОкончания + ДатаДокумента + НомерДокумента;
			КонецЦикла;
			
			ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПараметрыСисетмыЗаказов", ТаблицаПараметрыСисетмыЗаказов);
		КонецЕсли;
		
	КонецПроцедуры
	
	Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДополнительныеСвойства)
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ИзменениеПараметровСистемыЗаказов.Дата КАК Период,
		               |	ИзменениеПараметровСистемыЗаказов.Ссылка КАК Ссылка,
		               |	ИзменениеПараметровСистемыЗаказов.Номер КАК Номер,
		               |	ИзменениеПараметровСистемыЗаказов.ХозОперация КАК ХозОперация,
		               |	ИзменениеПараметровСистемыЗаказов.Организация КАК Организация,
		               |	ИзменениеПараметровСистемыЗаказов.ПодразделениеКомпании КАК ПодразделениеКомпании,
		               |	ИзменениеПараметровСистемыЗаказов.Контрагент КАК Контрагент,
		               |	ИзменениеПараметровСистемыЗаказов.Договор КАК Договор
		               |ИЗ
		               |	Документ.ИзменениеПараметровСистемыЗаказов КАК ИзменениеПараметровСистемыЗаказов
		               |ГДЕ
		               |	ИзменениеПараметровСистемыЗаказов.Ссылка = &Ссылка";
		Реквизиты = Запрос.Выполнить().Выбрать();
		Реквизиты.Следующий();
		
		Запрос.УстановитьПараметр("Период",Реквизиты.Период);
		Запрос.УстановитьПараметр("Ссылка",Реквизиты.Ссылка);
		Запрос.УстановитьПараметр("ХозОперация",Реквизиты.ХозОперация);
		Запрос.УстановитьПараметр("Организация",Реквизиты.Организация);
		Запрос.УстановитьПараметр("ПодразделениеКомпании",Реквизиты.ПодразделениеКомпании);
		Запрос.УстановитьПараметр("Договор",Реквизиты.Договор);
		
		ДополнительныеСвойства.ДляПроведения.Вставить("Номер", Реквизиты.Номер);
		ДополнительныеСвойства.ДляПроведения.Вставить("ХозОперация", Реквизиты.ХозОперация);
		ДополнительныеСвойства.ДляПроведения.Вставить("ПодразделениеКомпании", 	Реквизиты.ПодразделениеКомпании);
		
	КонецПроцедуры
	
	Функция ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса)	
		
		ХозОперация = Неопределено;
		Запрос.Параметры.Свойство("ХозОперация", ХозОперация);
		
		ИмяРегистра = "ВтТаблицаТовары";
		
		//Если ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.УстановкаПараметровСистемыЗаказовВыборочная") Тогда 
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ИзменениеПараметровСистемыЗаказовТоварыДокумента.Ссылка КАК Ссылка,
		               |	ИзменениеПараметровСистемыЗаказовТоварыДокумента.ТочкаДоставки КАК ТочкаДоставки,
		               |	ИзменениеПараметровСистемыЗаказовТоварыДокумента.Номенклатура КАК Номенклатура,
		               |	&Договор КАК Договор,
		               |	ИзменениеПараметровСистемыЗаказовТоварыДокумента.ПериодичностьЗаказа КАК ПериодичностьЗаказа,
		               |	ИзменениеПараметровСистемыЗаказовТоварыДокумента.МодельРасчета КАК МодельРасчета,
		               |	ИзменениеПараметровСистемыЗаказовТоварыДокумента.ВариантОкругления КАК ВариантОкругления,
		               |	ИзменениеПараметровСистемыЗаказовТоварыДокумента.ДниНедели КАК ДниНедели,
		               |	ИзменениеПараметровСистемыЗаказовТоварыДокумента.СрокПоставкиПоДнямНедели КАК СрокПоставкиПоДнямНедели,
		               |	ИзменениеПараметровСистемыЗаказовТоварыДокумента.СрокПоставки КАК СрокПоставки,
		               |	ИзменениеПараметровСистемыЗаказовТоварыДокумента.КвантПоставки КАК КвантПоставки,
		               |	ИзменениеПараметровСистемыЗаказовТоварыДокумента.Количество КАК Количество,
		               |	ИзменениеПараметровСистемыЗаказовТоварыДокумента.МинимальныйОстаток КАК МинимальныйОстаток,
		               |	ИзменениеПараметровСистемыЗаказовТоварыДокумента.ОстатокВитрина КАК ОстатокВитрина,
		               |	ИзменениеПараметровСистемыЗаказовТоварыДокумента.РегламентЗаказа КАК РегламентЗаказа
		               |ПОМЕСТИТЬ ВтТаблицаТовары
		               |ИЗ
		               |	Документ.ИзменениеПараметровСистемыЗаказов.ТоварыДокумента КАК ИзменениеПараметровСистемыЗаказовТоварыДокумента
		               |ГДЕ
		               |	ИзменениеПараметровСистемыЗаказовТоварыДокумента.Ссылка = &Ссылка";
		
		
		ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
		
		Возврат ТекстЗапроса;
	КонецФункции
	
	Функция ТекстЗапросаПараметрыСисетмыЗаказов(Запрос, ТекстыЗапроса, Регистры)	
		
		ИмяРегистра = "ПараметрыСистемыЗаказов";
		
		Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
			Возврат "";
		КонецЕсли; 
		
		Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
			ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
		КонецЕсли; 
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	&Период КАК Период,
		               |	ВтТаблицаТовары.ТочкаДоставки КАК ТочкаДоставки,
		               |	ВтТаблицаТовары.Номенклатура КАК Номенклатура,
		               |	ВтТаблицаТовары.Договор КАК Договор,
		               |	ВтТаблицаТовары.ПериодичностьЗаказа КАК ПериодичностьЗаказа,
		               |	ВтТаблицаТовары.МодельРасчета КАК МодельРасчета,
		               |	ВтТаблицаТовары.ВариантОкругления КАК ВариантОкругления,
		               |	ВтТаблицаТовары.ДниНедели КАК ДниНедели,
		               |	ВтТаблицаТовары.СрокПоставкиПоДнямНедели КАК СрокПоставкиПоДнямНедели,
		               |	ВтТаблицаТовары.СрокПоставки КАК СрокПоставки,
		               |	ВтТаблицаТовары.КвантПоставки КАК КвантПоставки,
		               |	ВтТаблицаТовары.Количество КАК Количество,
		               |	ВтТаблицаТовары.МинимальныйОстаток КАК МинимальныйОстаток,
		               |	ВтТаблицаТовары.ОстатокВитрина КАК ОстатокВитрина,
		               |	ВтТаблицаТовары.РегламентЗаказа КАК РегламентЗаказа
		               |ИЗ
		               |	ВтТаблицаТовары КАК ВтТаблицаТовары";
		
		ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
		
		Возврат ТекстЗапроса;
		
	КонецФункции
	
	
	#КонецОбласти	
	
	
	#Область ПрограммныйИнтерфейс
	
	// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
	Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация)
		|	И ЗначениеРазрешено(ПодразделениеКомпании)
		|	И ЗначениеРазрешено(ТорговаяПлощадка)";
		
		Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
		
	КонецПроцедуры
	
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	
	#КонецОбласти
	
	
	
	
#КонецЕсли
